# **Tarea Nº 4**

- Fecha y hora de entrega: Domingo 12 de enero, 11:59pm
- Agregue los nombres de las personas con las que discutió esta tarea: ____ Ariza Saito ____ Sebatian Jimenez ____ Marco Meza ____
- Envíe su tarea haciendo el `push` de su código a su repo en GitHub Classroom:

### Evaluación

- Nota: **17/20**

¡Buen trabajo en general!

## **Mercado de autos usados**

Importa el conjunto de datos `neoauto_20240924.csv`

In [ ]:
pip install pandas

In [2]:
import pandas as pd
df  = pd.read_csv('neoauto_20240924.csv')

1. ¿Cuál es el precio promedio de los autos de cada marca (`item_brand`) publicados en cada subcategoría (`item_category_2`)?

In [9]:
df.groupby(['item_category_2', 'item_brand']).agg({'price': 'mean'})

                                       price
item_category_2 item_brand
Camionetas Suv  ASTON MARTIN   229000.000000
                AUDI            34602.424242
                BAIC            10800.000000
                BAIC YINXIANG    8500.000000
                BMW             38377.802469
...                                      ...
Vans            RAM              8883.333333
                RENAULT          4900.000000
                SUZUKI          11058.333333
                TOYOTA          16080.000000
                VOLKSWAGEN      14350.000000

[202 rows x 1 columns]

2. ¿Cuántos autos tienen más de 100,000 kilómetros (`item_km`) pero un precio (`item_price`) menor al promedio general?

In [16]:
avg_price = df['price'].mean()
num_objetive = df['item_id'][(df['price'] < avg_price) & (df['item_km'] > 100000)].count()
print("The number of cars with a price higher than the average and more than 100,000 km is: ", num_objetive)

The number of cars with a price higher than the average and more than 100,000 km is:  497

3. Encuentra el modelo (`item_name`) más caro y el más barato de cada marca (`item_brand`).

In [35]:
df_most_expensive = (df.loc[df.groupby('item_brand')['item_price'].idxmax()][['item_brand', 'item_name']].
                     rename(columns = {'item_name' : 'most_expensive'}))
df_cheapest = (df.loc[df.groupby('item_brand')['item_price'].idxmin()][['item_brand', 'item_name']].
               rename(columns = {'item_name' : 'cheapest'}))
df_most_expensive.merge(df_cheapest, on = 'item_brand')

      item_brand            most_expensive                        cheapest
0     ALFA-ROMEO       alfa-romeo 147 2006         alfa-romeo alfasud 1982
1   ASTON MARTIN     aston martin dbx 2021          aston martin db11 2017
2           AUDI            audi rs 6 2024              audi a3 sedan 2015
3         AUSTIN   austin mini cooper 1970         austin mini cooper 1970
4           BAIC             baic x55 2021                  baic plus 2018
..           ...                       ...                             ...
68           SWM          swm g05 pro 2022                swm g05 pro 2022
69        TOYOTA         toyota hilux 2019  toyota land cruiser prado 2011
70       TRIUMPH         triumph tr-7 1971               triumph tr-7 1971
71    VOLKSWAGEN  volkswagen teramont 2023            volkswagen bora 2015
72         VOLVO          volvo xc-90 2023            volvo 850 turbo 1995

[73 rows x 3 columns]

4. Encuentra las tres marcas con mayor número de autos financiados por Santander (`item_financed_by`).

In [46]:
top_3_financed_by_Santander = (df.groupby(['item_brand', 'item_financed_by']).agg({'item_id' : 'count'}).
                               sort_values('item_id', ascending = False).
                               rename(columns = {'item_id' : 'num_financed'}))
top_3_financed_by_Santander.head(3)

                             num_financed
item_brand item_financed_by
BMW        Santander                  296
TOYOTA     Santander                  261
NISSAN     Santander                  228

5. Agrupa las publicaciones por tipo de transmisión (`item_transmission`) y calcula la desviación estándar del precio (`item_price`) para cada tipo.

In [47]:
df.groupby('item_transmission').agg({'price' : 'std'})

                                price
item_transmission
Automática               15332.729048
Automática - Secuencial  22678.641589
Mecánica                  8137.122127

6. ¿Cuál es el kilometraje promedio de las publicaciones con el tag "Premium" y de las publicaciones con el tag "Como nuevo"?

In [3]:
km_avg_como_nuevo = df[df['item_tag'] == 'Como nuevo']['item_km'].mean()
km_avg_premiun = df[df['item_publication_type'] == 'PREMIUM']['item_km'].mean()
km_avg_como_nuevo, km_avg_premiun
print("The average km of the cars in the 'Como nuevo' category is: ", km_avg_como_nuevo)
print("The average km of the cars in the 'PREMIUM' category is: ", km_avg_premiun)

The average km of the cars in the 'Como nuevo' category is:  35963.47619047619
The average km of the cars in the 'PREMIUM' category is:  48131.67698019802

7. ¿Cuáles son las marcas de vehículas para los que todos sus modelos fabricados en los últimos 5 años tienen al menos 5 publicaciones cada una?

In [6]:
recent_vehicles = df[df['item_year'] >= 2021]
publications_per_model = recent_vehicles.groupby(['item_brand', 'item_name']).size()
brands_with_all_models_5_plus = (
    publications_per_model.groupby(level=0)
    .filter(lambda x: x.min() >= 5)
    .index.get_level_values(0)
    .unique()
)
# Se asume que se busca que cada uno de los modelos de una marca tenga al menos 5 publicaciones
brands_with_all_models_5_plus
print("The brands that have all their models with 5 or more publications are: ", brands_with_all_models_5_plus.tolist())

The brands that have all their models with 5 or more publications are:  []

## **Evolución económica internacional**

Importa el conjunto de datos de la hoja "Data" del archivo `pwt1001.xlsx`. El diccionario de variables está disponible en la hoja "Legend" del archivo Excel.

In [63]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
                                              0.0/250.9 kB ? eta -:--:--
     ------------------                     122.9/250.9 kB 7.5 MB/s eta 0:00:01
     -------------------------------------- 250.9/250.9 kB 3.9 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
data_df = pd.read_excel('pwt1001.xlsx', sheet_name = 'Data')

1. Calcule el PBI per cápita real ajustado por poder de paridad de compra (PPP). Use la variable de PBI que se calcula por gasto y la población. ¿Cuáles son los 10 países top?

In [20]:
data_df['rgdp_per_capita_ppp'] = data_df['rgdpe'] / data_df['pop']
top_10_countries = data_df[data_df['year'] == 2019][['country', 'rgdp_per_capita_ppp']].sort_values(by='rgdp_per_capita_ppp', 
                                                                                  ascending=False).head(10)
top_10_countries

                    country  rgdp_per_capita_ppp
7209             Luxembourg        112941.453342
7349       China, Macao SAR        105337.890061
9799                  Qatar        103445.127269
5599                Ireland        102353.631443
10289             Singapore         88619.305271
1609                Bermuda         79967.588736
2239            Switzerland         71831.637057
3079         Cayman Islands         70208.345162
349    United Arab Emirates         69753.215256
1889      Brunei Darussalam         67555.392597

2. Genera el ránking de los países con el mayor incremento del PBI per cápita real PPP entre los años 1990 y 2019. ¿Dónde se ubica Perú? Para los países que no tengan información para dichos años, puede utilizar datos provenientes de hasta dos años antes o después

In [29]:
data_df["PBI_per_capita_PPP"]=data_df["rgdpe"]/data_df["pop"]
data_2019=data_df[(data_df["year"]>=2017) & (data_df["year"]<=2021)]
data_1990=data_df[(data_df["year"]>=1990) & (data_df["year"]<=1992)]
data_2019=data_2019.sort_values("year",ascending=False).drop_duplicates(subset="country",keep="first")
data_1990=data_1990.drop_duplicates(subset="country",keep="first")
variacion_data = pd.merge(
    data_1990[["country", "PBI_per_capita_PPP"]],
    data_2019[["country", "PBI_per_capita_PPP"]],
    on="country",
    suffixes=("_1990", "_2019"))
variacion_data["PBI2019-PBI1990"]=(variacion_data["PBI_per_capita_PPP_2019"]-variacion_data["PBI_per_capita_PPP_1990"])/(variacion_data["PBI_per_capita_PPP_1990"])
ranking=variacion_data.sort_values("PBI2019-PBI1990",ascending=False).reset_index()
ranking["Posicion"]=ranking.index+1
ranking[ranking["country"]=="Peru"][["country","PBI2019-PBI1990","Posicion"]]

   country  PBI2019-PBI1990  Posicion
31    Peru         2.357596        32

In [31]:
ranking.head(10)

,index,country,PBI_per_capita_PPP_1990,PBI_per_capita_PPP_2019,PBI2019-PBI1990,Posicion
0,67,Equatorial Guinea,2106.007737,22214.046124,9.547941,1
1,19,Bosnia and Herzegovina,1556.278685,14224.127158,8.139833,2
2,148,El Salvador,1162.089916,8331.298521,6.169237,3
3,113,Myanmar,748.833356,4819.900500,5.436546,4
4,124,Nigeria,836.472147,4893.912405,4.850658,5
5,95,Lao People's DR,1265.123309,7359.113354,4.816914,6
6,178,Viet Nam,1365.924213,7782.607919,4.697686,7
7,33,China,2477.863628,13988.209097,4.645270,8
8,79,Ireland,19626.917875,102353.631443,4.214962,9
9,53,Egypt,2237.634075,10975.896758,3.905135,10

3. Para el periodo 2010-2019, calcule el promedio del índice del capital humano. ¿Qué relación existe entre esta variable y el PBI per cápita real PPP calculado previamente? ¿y el número de horas laboradas al año por los trabajadores?

In [68]:
hc_period = data_df[(data_df['year'] >= 2010) & (data_df['year'] <= 2019)]
hc_avg = hc_period.groupby('country')['hc'].mean().reset_index().rename(columns={'hc': 'hc_avg'})
hc_avg

                                country    hc_avg
0                               Albania  2.934304
1                               Algeria  2.207947
2                                Angola  1.449344
3                              Anguilla       NaN
4                   Antigua and Barbuda       NaN
..                                  ...       ...
178  Venezuela (Bolivarian Republic of)  2.738341
179                            Viet Nam  2.647214
180                               Yemen  1.613632
181                              Zambia  2.465329
182                            Zimbabwe  2.554634

[183 rows x 2 columns]

In [8]:
data_2010_2019 = data_df[(data_df ["year"] >= 2010) & (data_df["year"] <= 2019)].dropna(subset = ["hc", "rgdpe", "pop", "avh"])
data_2010_2019["pbi_per_capita_ppp"] = (data_2010_2019["rgdpe"]) / (data_2010_2019["pop"])
prom_hc = data_2010_2019.groupby("country")["hc"].mean()
# Calcular el promedio del PBI per cápita real PPP y horas trabajadas por país
prom_pbi = data_2010_2019.groupby("country")["pbi_per_capita_ppp"].mean()
prom_horas = data_2010_2019.groupby("country")["avh"].mean()
# Unir los datos en un DataFrame
correlacion_data = pd.DataFrame({
    "prom_hc": prom_hc,
    "prom_pbi_per_capita_ppp": prom_pbi,
    "prom_horas": prom_horas
}).dropna()
# Calcular correlaciones
correlacion_pbi = correlacion_data["prom_hc"].corr(correlacion_data["prom_pbi_per_capita_ppp"])
correlacion_horas = correlacion_data["prom_hc"].corr(correlacion_data["prom_horas"])
correlacion_pbi, correlacion_horas
print("The correlation between the average human capital and the average real GDP per capita PPP is: ", correlacion_pbi)
print("The correlation between the average human capital and the average hours worked is: ", correlacion_horas)

The correlation between the average human capital and the average real GDP per capita PPP is:  0.7062890338861632
The correlation between the average human capital and the average hours worked is:  -0.5769666048397843

4. A partir de la variable del precio de los hogares, calcula los países y los años en los cuales se registró la mayor inflación anual para todo el periodo de tiempo disponible en la base de datos

In [69]:
data_df['inflation'] = data_df.groupby('country')['pl_c'].pct_change() * 100
highest_inflation = data_df[['country', 'year', 'inflation']].sort_values(by='inflation', ascending=False).dropna().head(10)
highest_inflation

C:\Users\a2019\AppData\Local\Temp\ipykernel_12060\3234908707.py:1: FutureWarning: The default fill_method='ffill' in SeriesGroupBy.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  data_df['inflation'] = data_df.groupby('country')['pl_c'].pct_change() * 100

                                  country  year   inflation
12387  Venezuela (Bolivarian Republic of)  2017  355.748049
12795                            Zimbabwe  2005  281.705724
4742                    Equatorial Guinea  2002  278.866183
1850                    Brunei Darussalam  1980  265.190719
8201                           Mauritania  1961  235.565319
11034                          Seychelles  1994  226.327482
12794                            Zimbabwe  2004  163.377645
10034                        Saudi Arabia  1974  147.961250
119                                Angola  1999  144.032916
304                  United Arab Emirates  1974  140.988488

5. ¿Cuáles son los países con la mayor cantidad de missing values en la variable de productividad total de factores a precios corrientes?

In [34]:
missing_ctfp = data_df.groupby('country')['ctfp'].apply(lambda x: x.isna().sum()).reset_index(name='missing_ctfp')
top_missing_ctfp = missing_ctfp.sort_values(by='missing_ctfp', ascending=False)
top_missing_ctfp

                                country  missing_ctfp
0                               Albania            70
1                               Algeria            70
3                              Anguilla            70
4                   Antigua and Barbuda            70
13                           Bangladesh            70
..                                  ...           ...
167                              Turkey             4
174                      United Kingdom             4
178  Venezuela (Bolivarian Republic of)             4
175                       United States             4
176                             Uruguay             4

[183 rows x 2 columns]

6.  Agrupa los datos por país y calcula el promedio de las horas trabajadas anuales (avh) y de la educación promedio (hc) para el periodo 2000-2020.

In [71]:
period_2000_2020 = data_df[(data_df['year'] >= 2000) & (data_df['year'] <= 2020)]
average_avh_hc = period_2000_2020.groupby('country').agg({'avh': 'mean', 'hc': 'mean'}).reset_index()
average_avh_hc

                                country          avh        hc
0                               Albania          NaN  2.895579
1                               Algeria          NaN  2.080837
2                                Angola          NaN  1.399746
3                              Anguilla          NaN       NaN
4                   Antigua and Barbuda          NaN       NaN
..                                  ...          ...       ...
178  Venezuela (Bolivarian Republic of)  1874.516018  2.538335
179                            Viet Nam  2243.230824  2.407059
180                               Yemen          NaN  1.444725
181                              Zambia          NaN  2.304970
182                            Zimbabwe          NaN  2.388763

[183 rows x 3 columns]

7.  Genere una variable que ordene a los países según el porcetaje de formación brutal de capital del 2019. Luego, estable diez grupos a manera de deciles. ¿En qué decil se ubica Péru? Vuelva a calcular usando la información de 1990. ¿El Perú se mantiene en el mismo décil o cambia?

In [72]:
csh_i_2019 = data_df[data_df['year'] == 2019][['country', 'csh_i']].dropna()
csh_i_1990 = data_df[data_df['year'] == 1990][['country', 'csh_i']].dropna()


csh_i_2019['decile_2019'] = pd.qcut(csh_i_2019['csh_i'], 10, labels=False) + 1
csh_i_1990['decile_1990'] = pd.qcut(csh_i_1990['csh_i'], 10, labels=False) + 1

deciles_comparison = pd.merge(csh_i_2019, csh_i_1990, on='country', how='outer')
peru_decile = deciles_comparison[deciles_comparison['country'] == 'Peru']
peru_decile

    country   csh_i_x  decile_2019   csh_i_y  decile_1990
129    Peru  0.205378            5  0.138082          4.0

## **Transacciones Financieras**

Importa el conjunto de datos `base_financiera.csv`

In [42]:
base_financiera = pd.read_csv('base_financiera.csv')

8. Filtra todas las transacciones de tipo "Debit" en las que el monto sea mayor a 200, y calcula el monto total de esas transacciones. Además, determina cuántos clientes únicos realizaron esas transacciones.

In [36]:
debit_transactions = base_financiera[(base_financiera['Transaction_Type'] == 'Debit') & (base_financiera['Amount'] > 200)]
total_debit_amount = debit_transactions['Amount'].sum()
unique_customers = debit_transactions['Customer_ID'].nunique()

total_debit_amount, unique_customers
print("The total amount of debit transactions is: ", total_debit_amount)
print("The number of unique customers is: ", unique_customers)

The total amount of debit transactions is:  2847871.75
The number of unique customers is:  200

9. Identifica las transacciones con valores nulos en la columna (`Amount`) . Rellena esos valores con la mediana de los montos por tipo de transacción (`Transaction_Type`) y luego calcula el monto total de transacciones por región (`region`) .

In [43]:
missing_values = base_financiera['Amount'].isnull().sum()

print("The number of missing values in the 'Amount' column is: ", missing_values)

median_amounts = base_financiera.groupby('Transaction_Type')['Amount'].median()
base_financiera['Amount'] = base_financiera.apply(lambda row: median_amounts[row['Transaction_Type']] if pd.isnull(row['Amount']) else row['Amount'], axis=1)
total_amount_by_region = base_financiera.groupby('Region')['Amount'].sum()

print("The total amount by region is: ")
print(total_amount_by_region)

The number of missing values in the 'Amount' column is:  113
The total amount by region is:
Region
East     1269409.53
North    1321224.96
South    1208300.23
West     1233552.50
Name: Amount, dtype: float64

10. Busca transacciones duplicadas considerando las columnas (`Customer_ID`) y (`Date`). Elimina los duplicados manteniendo solo la primera ocurrencia. Luego, agrupa las transacciones restantes por (`Customer_ID`) y calcula el monto promedio y la cantidad de transacciones por cliente.

In [44]:
duplicates = base_financiera.duplicated(subset=['Customer_ID', 'Date']).sum()

base_cleaned = base_financiera.drop_duplicates(subset=['Customer_ID', 'Date'], keep='first')

customer_summary_new = base_cleaned.groupby('Customer_ID').agg(Average_Amount=('Amount', 'mean'),
                                                               Transaction_Count=('Transaction_ID', 'count')
)

duplicates, customer_summary_new.head()
print("The number of duplicates is: ", duplicates)
print("The customer summary is: ")
print(customer_summary_new.head())

The number of duplicates is:  234
The customer summary is:
             Average_Amount  Transaction_Count
Customer_ID
C001            3283.319412                 17
C002            1881.827778                  9
C003            3102.125000                 14
C004            2879.267143                  7
C005            3364.053333                  6